Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_trigger.c
/* SPDX-License-Identifier: Apache-2.0 */
/* TFLM model backend for the official Media Trigger contract.
 * Reuses this repository's validated tensor/frontend adapter and frozen
 * score policy. It has no recorder, VAD, conversation or product owner.
 * Media serializes load/detect/unload on its trigger worker. */
#include "bk7258_voice_kws.h"
#include "bk7258_voice_kws_model.h"
#include "bk7258_voice_wake_package.h"
#include "bk7258_voice_media.h"
#include "bk7258_control_session.h"

#include <nuttx/config.h>
#include <media_trigger.h>
#include <media_trigger_model.h>
#include <errno.h>
#include <fcntl.h>
#include <stdatomic.h>
#include <sys/stat.h>
#include <time.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <syslog.h>
#include <unistd.h>
#include <mbedtls/sha256.h>
#include "voice/audio_playback.h"
#include "voice/voice_channel.h"

#define BKVOICE_TRIGGER_RATE 16000u
#define BKVOICE_TRIGGER_SAMPLES 320u
#define BKVOICE_TRIGGER_BYTES (BKVOICE_TRIGGER_SAMPLES * sizeof(int16_t))

struct bkvoice_trigger_model_s
{
  unsigned char *model_bytes;
  void *arena_allocation;
  void *arena;
  struct bkvoice_kws_model_s *model;
  struct bkvoice_kws_s kws;
  hotword_detection_callback_t callback;
  void *callback_priv;
  uint8_t frame[BKVOICE_TRIGGER_BYTES];
  size_t frame_used;
  size_t model_size;
  uint64_t next_frame_ms;
  uint32_t input_frames;
  uint32_t input_mean_min;
  uint32_t input_mean_max;
  float score;
  bool model_open;
  bool kws_initialized;
  bool error_reported;
};

static struct bkvoice_trigger_model_s *g_trigger;
static atomic_bool g_model_stream_reset_pending;
static atomic_uint g_wake_threshold_percent = 60;

unsigned int bk7258_agent_trigger_threshold_get(void)
{
  return atomic_load(&g_wake_threshold_percent);
}

int bk7258_agent_trigger_threshold_set(unsigned int percent)
{
  if (percent < 50 || percent > 90) return -ERANGE;
  atomic_store(&g_wake_threshold_percent, percent);
  return 0;
}

static void trigger_error(struct bkvoice_trigger_model_s *context, int error)
{
  hotword_detection_callback_t callback = NULL;
  void *priv = NULL;

  if (g_trigger == context && !context->error_reported)
    {
      context->error_reported = true;
      callback = context->callback;
      priv = context->callback_priv;
    }

  if (callback != NULL)
    {
      callback(priv, 1, error < 0 ? error : -EIO, NULL);
    }
}

void media_trigger_model_get_properties(void *properties, size_t *size)
{
  static const char value[] = "bk7258-kws";
  size_t bytes = sizeof(value);

  if (size == NULL)
    {
      return;
    }
  if (properties != NULL && *size != 0)
    {
      size_t copy = bytes < *size ? bytes : *size;
      memcpy(properties, value, copy);
      if (copy == *size)
        {
          ((char *)properties)[copy - 1] = '\0';
        }
    }
  *size = bytes;
}

void *media_trigger_model_load(const void *data, size_t size,
                               hotword_detection_callback_t callback,
                               void *priv)
{
  struct bkvoice_trigger_model_s *context;
  struct bkvoice_kws_model_spec_s spec;
  struct bkvoice_kws_policy_s policy;
  uintptr_t aligned;
  int ret;
  struct bkvoice_wake_package_s package;

  /* Media carries the existing asset envelope so the model backend validates
   * the same label and bytes that the product reports to the App. */
  if (bkvoice_wake_package_decode(data, size, &package) != 0)
    {
      return NULL;
    }
  uint8_t hash[32];
  if (mbedtls_sha256(package.model, package.model_size, hash, 0) != 0 ||
      memcmp(hash, package.sha256, sizeof(hash))) return NULL;
  data = package.model;
  size = package.model_size;

  if (g_trigger != NULL)
    {
          return NULL;
    }
  context = calloc(1, sizeof(*context));
  if (context != NULL)
    {
      g_trigger = context;
    }
  if (context == NULL)
    {
      return NULL;
    }

  context->model_bytes = malloc(size);
  context->arena_allocation = malloc(CONFIG_BK7258_VOICE_KWS_ARENA_BYTES + 15u);
  if (context->model_bytes == NULL || context->arena_allocation == NULL)
    {
      ret = -ENOMEM;
      goto fail;
    }
  memcpy(context->model_bytes, data, size);
  context->model_size = size;
  aligned = ((uintptr_t)context->arena_allocation + 15u) & ~(uintptr_t)15u;
  context->arena = (void *)aligned;

  memset(&spec, 0, sizeof(spec));
  spec.data = context->model_bytes;
  spec.bytes = context->model_size;
  spec.frontend = BKVOICE_KWS_FRONTEND_ID;
  spec.labels[0] = "silence";
  spec.labels[1] = "unknown";
  spec.labels[2] = package.label;
  ret = bkvoice_kws_model_open(&spec, context->arena,
                               CONFIG_BK7258_VOICE_KWS_ARENA_BYTES,
                               &context->model);
  if (ret < 0)
    {
      goto fail;
    }
  context->model_open = true;
  bkvoice_kws_default_policy(&policy);
  policy.threshold = bk7258_agent_trigger_threshold_get() / 100.0f;
  ret = bkvoice_kws_initialize(&context->kws, &policy,
                               bkvoice_kws_model_infer, context->model);
  if (ret < 0)
    {
      goto fail;
    }
  context->kws_initialized = true;
  context->callback = callback;
  context->next_frame_ms = 0;
  context->callback_priv = priv;
  syslog(LOG_INFO, "BKVOICE trigger model bytes=%zu arena_used=%zu\n",
         size, bkvoice_kws_model_arena_used(context->model));
  return context;

fail:
  syslog(LOG_ERR, "BKVOICE trigger model load ret=%d\n", ret);
  media_trigger_model_unload(context);
  return NULL;
}

static int trigger_model_reset(void *opaque)
{
  struct bkvoice_trigger_model_s *context = opaque;
  int ret;

  if (context == NULL || g_trigger != context ||
      !context->kws_initialized || !context->model_open)
    {
      return -EINVAL;
    }

  /* Called serially by the Media worker; a new audio stream must not inherit
   * the previous window or trigger latch. The TFLM arena, model and front-end
   * allocations are kept, and the score threshold and consecutive-frame
   * policy are unchanged.
   */

  bkvoice_kws_pause(&context->kws);

  /* A new stream has no audio from the past three seconds, so the same front
   * end is used to generate silent history. If rows=0 waited for the window
   * to fill, a short word spoken right after the announcement would slide out
   * of a valid position before the first inference and could not satisfy the
   * model's original two-consecutive-frame condition. Only the missing
   * history is filled in here; later input, the score threshold and events
   * still come entirely from the normal MIC detection path.
   */

  ret = bkvoice_kws_frontend_frame(&context->kws.frontend,
                                   context->kws.pcm,
                                   context->kws.features);
  if (ret < 0)
    {
      return ret;
    }

  for (unsigned int row = 1; row < BKVOICE_KWS_ROWS; row++)
    {
      memcpy(context->kws.features + row * BKVOICE_KWS_BINS,
             context->kws.features, BKVOICE_KWS_BINS * sizeof(float));
    }

