Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_trigger.c
  context->kws.rows = BKVOICE_KWS_ROWS;
  context->kws.pending = BKVOICE_KWS_WINDOW - BKVOICE_KWS_HOP;
  context->kws.last_ms = 0;
  context->kws.triggered_ms = 0;
  context->kws.timestamp_valid = false;
  context->kws.armed = true;
  context->frame_used = 0;
  context->next_frame_ms = 0;
  context->input_frames = 0;
  context->score = 0;
  context->error_reported = false;
  syslog(LOG_INFO, "BKVOICE Trigger model stream reset\n");
  return 0;
}

void media_trigger_model_get_options(void *context, char *options, size_t size)
{
  if (context == NULL || options == NULL || size == 0)
    {
      return;
    }
  (void)snprintf(options, size,
                 "format=s16le:sample_rate=16000:ch_layout=mono");
}

void media_trigger_model_get_buffer_size(void *context, size_t *size)
{
  if (size != NULL)
    {
      *size = context != NULL ? BKVOICE_TRIGGER_BYTES : 0;
    }
}

bool media_trigger_model_detect_hotword(void *opaque, const char *buffer,
                                        size_t size)
{
  struct bkvoice_trigger_model_s *context = opaque;
  bool detected = false;
  int error = 0;

  if (context == NULL || buffer == NULL)
    {
      return false;
    }
  if (g_trigger != context)
    {
          return false;
    }

  /* The control thread only marks the new stream; features, latch and framing
   * state stay owned exclusively by the Media worker. The next start is
   * requested only after an existing stop has returned, so a window being
   * inferred is never cleaned up concurrently.
   */

  if (atomic_exchange(&g_model_stream_reset_pending, false))
    {
      error = trigger_model_reset(context);
      if (error < 0)
        {
          trigger_error(context, error);
          return false;
        }
    }
  if (context->error_reported)
    {
      return false;
    }
  /* The control thread only publishes the threshold; the Media worker owns
   * detection-state updates and does not rebuild the capture.
   */
  float threshold = bk7258_agent_trigger_threshold_get() / 100.0f;
  if (context->kws.policy.threshold != threshold)
    {
      context->kws.policy.threshold = threshold;
      context->kws.hits = 0;
    }
  while (size > 0)
    {
      uint32_t mean;
      size_t copy = BKVOICE_TRIGGER_BYTES - context->frame_used;
      if (copy > size) copy = size;
      memcpy(context->frame + context->frame_used, buffer, copy);
      context->frame_used += copy;
      buffer += copy;
      size -= copy;
      if (context->frame_used != BKVOICE_TRIGGER_BYTES) continue;
      context->frame_used = 0;
      context->next_frame_ms += 20u;
      /* Only model input diagnostics live here. Media owns the recorder,
       * and the Agent channel owns speech endpointing and rearming. */
      mean = 0;
      for (unsigned int i = 0; i < BKVOICE_TRIGGER_SAMPLES; i++)
        {
          int16_t sample;
          memcpy(&sample, context->frame + i * sizeof(sample), sizeof(sample));
          mean += sample < 0 ? -(int32_t)sample : sample;
        }
      mean /= BKVOICE_TRIGGER_SAMPLES;
      if (context->input_frames++ == 0)
        {
          context->input_mean_min = mean;
          context->input_mean_max = mean;
        }
      if (mean < context->input_mean_min) context->input_mean_min = mean;
      if (mean > context->input_mean_max) context->input_mean_max = mean;
      if (context->input_frames == 500u)
        {
          syslog(LOG_INFO, "BKVOICE trigger input frames=%lu mean_abs=%lu/%lu "
                 "\n", (unsigned long)context->input_frames,
                 (unsigned long)context->input_mean_min,
                 (unsigned long)context->input_mean_max);
          context->input_frames = 0;
        }
      error = bkvoice_kws_feed(&context->kws,
        (const int16_t *)context->frame, BKVOICE_TRIGGER_SAMPLES,
        context->next_frame_ms, &context->score);
      if (error < 0) break;
      if (error == 1)
        {
          detected = true;
          break;
        }
    }
  if (error < 0)
    {
      trigger_error(context, error);
    }
  return detected;
}

void media_trigger_model_unload(void *opaque)
{
  struct bkvoice_trigger_model_s *context = opaque;

  if (context == NULL) return;
  if (g_trigger == context) g_trigger = NULL;
  if (context->kws_initialized)
    {
      bkvoice_kws_uninitialize(&context->kws);
    }
  if (context->model_open)
    {
      bkvoice_kws_model_close(context->model);
    }
  if (context->arena_allocation != NULL)
    {
      memset(context->arena_allocation, 0,
             CONFIG_BK7258_VOICE_KWS_ARENA_BYTES + 15u);
      free(context->arena_allocation);
    }
  if (context->model_bytes != NULL)
    {
      memset(context->model_bytes, 0, context->model_size);
      free(context->model_bytes);
    }
  memset(context, 0, sizeof(*context));
  free(context);
}

int media_trigger_model_get_poll_fd(void *context)
{
  (void)context;
  return -1;
}

int media_trigger_model_poll_available(void *context)
{
  return context == NULL ? -EINVAL : -ENOSYS;
}

/* Serialized by the product worker. Callback threads only publish a wake
 * for the currently armed Media handle; no conversational state lives here. */
static struct {
  void *handle;
  bool loaded;
  bool recognizing;
  bool policy_active;
  bool capture_format_known;
  bool selection_known;
  bool uncertain;
  uint64_t revision;
  atomic_uint generation;
  atomic_bool accepting;
  atomic_bool turn_pending;
  atomic_int callback_error;
  struct bkvoice_wake_package_descriptor_s active;
  struct bkvoice_wake_package_descriptor_s previous;
  size_t active_size;
  size_t previous_size;
  uint8_t *pending_record;
  size_t pending_size;
  uint32_t pending_kind;
  int error;
} g_agent_trigger;

extern void bk7258_agent_product_wake(void);

static void wire_u32(uint8_t *p, uint32_t n)
{ p[0] = n >> 24; p[1] = n >> 16; p[2] = n >> 8; p[3] = n; }

static void wire_descriptor(uint8_t *p,
  const struct bkvoice_wake_package_descriptor_s *d, size_t size)
{
  memset(p, 0, BKVOICE_WAKE_PACKAGE_HEADER);
  if (!d->model_path[0] || !size) return;
  memcpy(p, "WKM1", 4);
  wire_u32(p + 4, size);
  for (size_t i = 0; i < 32; i++)
  {
    unsigned int value = 0;
    (void)sscanf(d->sha256_hex + 2 * i, "%2x", &value);
    p[8 + i] = value;
  }
  memcpy(p + 40, d->label, sizeof(d->label));
  memcpy(p + 72, d->phrase, sizeof(d->phrase));
}

static size_t model_file_size(const struct bkvoice_wake_package_descriptor_s *d)
{
  struct stat st;
  if (!d->model_path[0] || lstat(d->model_path, &st) ||
      !S_ISREG(st.st_mode) || st.st_size <= 0 ||
      st.st_size > BKVOICE_KWS_MODEL_MAX_BYTES) return 0;
  return st.st_size;
}

