Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_trigger.c
static void trigger_event(void *cookie, int event, int result, const char *extra)
{
  (void)extra;
  if ((uintptr_t)cookie != atomic_load(&g_agent_trigger.generation) ||
      !atomic_exchange(&g_agent_trigger.accepting, false)) return;
  if (event != 0 || result != 0)
    atomic_store(&g_agent_trigger.callback_error, result < 0 ? result : -EIO);
  atomic_store(&g_agent_trigger.turn_pending, true);
  bk7258_agent_product_wake();
}

static int trigger_pause(void)
{
  atomic_store(&g_agent_trigger.accepting, false);
  /* Let the Trigger finish its recorder stop/close before the Hotword route
   * is removed. If the route were removed first, the hotword callback racing
   * with stop would close a recorder that is still in recv; pcm0c would then
   * only see COMPLETE and enter a repeated open/close loop.
   */
  if (g_agent_trigger.recognizing)
  {
    int ret = media_trigger_stop_recognition(g_agent_trigger.handle);
    if (ret < 0) return ret;
    g_agent_trigger.recognizing = false;
  }
  if (g_agent_trigger.policy_active)
  {
    int ret = bkvoice_media_source_set_active(MEDIA_SOURCE_HOTWORD, false);
    if (ret < 0) return ret;
    g_agent_trigger.policy_active = false;
  }
  return 0;
}

int bk7258_agent_trigger_stop(void)
{
  int ret = trigger_pause();
  if (ret < 0) return ret;
  atomic_store(&g_agent_trigger.turn_pending, false);
  if (g_agent_trigger.loaded)
  {
    ret = media_trigger_unload_sound_model(g_agent_trigger.handle);
    if (ret < 0) return ret;
    g_agent_trigger.loaded = false;
    g_agent_trigger.active_size = 0;
  }
  if (g_agent_trigger.handle)
  {
    ret = media_trigger_close(g_agent_trigger.handle);
    if (ret < 0) return ret;
    g_agent_trigger.handle = NULL;
  }
  return 0;
}

bool bk7258_agent_trigger_armed(void)
{
  return g_agent_trigger.handle && g_agent_trigger.loaded &&
         g_agent_trigger.recognizing && g_agent_trigger.policy_active &&
         !g_agent_trigger.uncertain &&
         atomic_load(&g_agent_trigger.accepting);
}

int bk7258_agent_trigger_rearm(void)
{
  if (!g_agent_trigger.handle || !g_agent_trigger.loaded ||
      g_agent_trigger.uncertain) return -EBUSY;
  if (g_agent_trigger.recognizing)
    return g_agent_trigger.policy_active &&
           atomic_load(&g_agent_trigger.accepting) ? 0 : -EBUSY;
  int cleanup = audio_playback_cleanup(100);
  if (cleanup < 0) return cleanup;
  /* On a cold start the Trigger recorder establishes the format first and the
   * route is applied afterwards; once the 16 kHz format exists, the route is
   * restored first to drain the previous stop/complete before a new recorder
   * is started.
   */
  int ret = g_agent_trigger.capture_format_known ?
    bkvoice_media_source_set_active(MEDIA_SOURCE_HOTWORD, true) :
    bkvoice_media_source_stage_active(MEDIA_SOURCE_HOTWORD);
  if (!ret)
  {
    g_agent_trigger.policy_active = true;
    ret = media_trigger_start_recognition(g_agent_trigger.handle);
    if (!ret)
    {
      g_agent_trigger.recognizing = true;
      if (!g_agent_trigger.capture_format_known)
      {
        g_agent_trigger.capture_format_known = true;
        ret = bkvoice_media_source_apply_active();
      }
    }
    if (!ret)
    {
      atomic_store(&g_agent_trigger.callback_error, 0);
      atomic_store(&g_agent_trigger.accepting, true);
      atomic_store(&g_model_stream_reset_pending, true);
    }
  }
  if (ret)
  {
    atomic_store(&g_agent_trigger.accepting, false);
    (void)trigger_pause();
  }
  syslog(ret ? LOG_WARNING : LOG_INFO, "BKVOICE official Trigger rearm ret=%d\n", ret);
  return ret;
}

static int trigger_open_model(
  const struct bkvoice_wake_package_descriptor_s *selected, bool arm)
{
  size_t size = model_file_size(selected), used = 0;
  if (!size) return -EBADMSG;
  uint8_t *record = malloc(BKVOICE_WAKE_PACKAGE_HEADER + size);
  if (!record) return -ENOMEM;
  wire_descriptor(record, selected, size);
  int fd = open(selected->model_path, O_RDONLY | O_NOFOLLOW);
  int ret = fd < 0 ? -errno : 0;
  while (!ret && used < size)
  {
    ssize_t n = read(fd, record + BKVOICE_WAKE_PACKAGE_HEADER + used, size - used);
    if (n < 0 && errno == EINTR) continue;
    if (n <= 0) { ret = n < 0 ? -errno : -EIO; break; }
    used += n;
  }
  if (fd >= 0 && close(fd) < 0 && !ret) ret = -errno;
  uint8_t hash[32];
  if (!ret && (mbedtls_sha256(record + BKVOICE_WAKE_PACKAGE_HEADER, size, hash, 0) ||
               memcmp(hash, record + 8, 32))) ret = -EKEYREJECTED;
  if (!ret)
  {
    g_agent_trigger.handle = media_trigger_open("default");
    if (!g_agent_trigger.handle) ret = -ENODEV;
  }
  if (!ret)
  {
    unsigned int generation = atomic_fetch_add(&g_agent_trigger.generation, 1) + 1;
    ret = media_trigger_set_event_callback(g_agent_trigger.handle,
      (void *)(uintptr_t)generation, trigger_event);
  }
  if (!ret) ret = media_trigger_load_sound_model(g_agent_trigger.handle, record,
                                                 BKVOICE_WAKE_PACKAGE_HEADER + size);
  memset(record, 0, BKVOICE_WAKE_PACKAGE_HEADER + size);
  free(record);
  if (!ret)
  {
    g_agent_trigger.loaded = true;
    g_agent_trigger.active = *selected;
    g_agent_trigger.active_size = size;
    if (arm) ret = bk7258_agent_trigger_rearm();
  }
  if (ret) { (void)bk7258_agent_trigger_stop(); return ret; }
  syslog(LOG_INFO, "BKVOICE official Trigger active label=%s sha256=%s bytes=%zu\n",
         selected->label, selected->sha256_hex, size);
  return 0;
}

static int trigger_load_selected(bool arm)
{
  struct bkvoice_wake_package_descriptor_s selected = {0}, previous = {0};
  uint64_t revision = 0;
  int ret = bkvoice_wake_package_load(&selected, &previous, &revision);
  if (ret == -ENOENT)
  {
    snprintf(selected.model_path, sizeof(selected.model_path), "%s", CONFIG_BK7258_VOICE_KWS_MODEL_PATH);
    snprintf(selected.sha256_hex, sizeof(selected.sha256_hex), "%s", CONFIG_BK7258_VOICE_KWS_MODEL_SHA256);
    snprintf(selected.label, sizeof(selected.label), "%s", BKVOICE_KWS_LABEL);
    snprintf(selected.phrase, sizeof(selected.phrase), "%s", "你好，openvela");
    syslog(LOG_INFO, "BKVOICE model selection=builtin reason=no-persistent-selection\n");
  } else if (ret) { g_agent_trigger.error = ret; return ret; }
  g_agent_trigger.revision = revision;
  g_agent_trigger.previous = previous;
  g_agent_trigger.previous_size = model_file_size(&previous);
  g_agent_trigger.selection_known = true;
  ret = trigger_open_model(&selected, arm);
  g_agent_trigger.error = ret;
  return ret;
}

int bk7258_agent_trigger_prepare(void)
{
  if (g_agent_trigger.handle && g_agent_trigger.loaded) return 0;
  return trigger_load_selected(false);
}

