Embracecactus/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_agent_trigger.c
int bk7258_agent_trigger_start(void)
{
  if (g_agent_trigger.handle && g_agent_trigger.loaded)
    return bk7258_agent_trigger_rearm();
  return trigger_load_selected(true);
}

/* Existing asset transaction only: no audio turn, history or retry scheduler.
 * Old and candidate inference arenas never need to coexist. */
bool bk7258_agent_trigger_model_pending(void)
{
  return g_agent_trigger.pending_record != NULL;
}

int bk7258_agent_trigger_model_step(bool arm)
{
  if (!g_agent_trigger.pending_record) return 0;
  if (g_agent_trigger.handle && g_agent_trigger.recognizing &&
      !bk7258_agent_trigger_armed()) return -EBUSY;
  struct bkvoice_wake_package_descriptor_s old = g_agent_trigger.active;
  struct bkvoice_wake_package_descriptor_s desired = g_agent_trigger.previous;
  int ret = bk7258_agent_trigger_stop();
  if (!ret && g_agent_trigger.pending_kind == BKCONTROL_CONFIG_WAKE_MODEL)
  {
    struct bkvoice_wake_package_s spec;
    ret = bkvoice_wake_package_decode(g_agent_trigger.pending_record,
                                       g_agent_trigger.pending_size, &spec);
    if (!ret) ret = bkvoice_wake_package_validate(&spec);
    if (!ret) ret = bkvoice_wake_package_stage(&spec, &desired);
  }
  if (!ret) ret = trigger_open_model(&desired, arm);
  /* Trial recognition is stopped until the persistent selection is definite. */
  if (!ret) ret = trigger_pause();
  if (!ret) ret = bkvoice_wake_package_commit(&desired, &old, g_agent_trigger.revision);
  if (!ret)
  {
    g_agent_trigger.revision++;
    g_agent_trigger.previous = old;
    g_agent_trigger.previous_size = model_file_size(&old);
    if (arm) ret = bk7258_agent_trigger_rearm();
  }
  else
  {
    int stopped = bk7258_agent_trigger_stop();
    if (ret == -EINPROGRESS)
    {
      /* Do not overwrite an uncertain CAS publication or advertise either
       * model as usable. Reboot reloads the existing journal safely. */
      g_agent_trigger.uncertain = true;
    }
    else if (!stopped)
    {
      int restored = trigger_open_model(&old, arm);
      if (restored) ret = restored;
    } else ret = stopped;
  }
  memset(g_agent_trigger.pending_record, 0, g_agent_trigger.pending_size);
  free(g_agent_trigger.pending_record);
  g_agent_trigger.pending_record = NULL;
  g_agent_trigger.pending_size = 0;
  g_agent_trigger.error = ret;
  syslog(ret ? LOG_WARNING : LOG_INFO, "BKVOICE model apply result=%d loaded=%d\n",
         ret, g_agent_trigger.loaded);
  return ret;
}

int bk7258_agent_trigger_control(void *context, enum bkcontrol_command_e command,
  uint32_t kind, uint32_t offset, const uint8_t *record, size_t size,
  struct bkcontrol_status_s *status)
{
  (void)context;
  if (kind != BKCONTROL_CONFIG_WAKE_MODEL && kind != BKCONTROL_CONFIG_WAKE_RESTORE)
    return -ENOTSUP;
  if (command == BKCONTROL_CONFIG_READ)
  {
    if (!g_agent_trigger.selection_known || !g_agent_trigger.active_size)
      return g_agent_trigger.error ? g_agent_trigger.error : -EAGAIN;
    uint8_t wire[12 + 2 * BKVOICE_WAKE_PACKAGE_HEADER] = {'W', 'K', 'S', '1'};
    if (kind != BKCONTROL_CONFIG_WAKE_MODEL || offset >= sizeof(wire) || (offset & 15u))
      return -ERANGE;
    wire_u32(wire + 4, g_agent_trigger.pending_record != NULL);
    wire_u32(wire + 8, (uint32_t)g_agent_trigger.error);
    wire_descriptor(wire + 12, &g_agent_trigger.active, g_agent_trigger.active_size);
    wire_descriptor(wire + 12 + BKVOICE_WAKE_PACKAGE_HEADER,
                      &g_agent_trigger.previous, g_agent_trigger.previous_size);
    status->config_total = sizeof(wire);
    memset(status->config_chunk, 0, sizeof(status->config_chunk));
    size_t count = sizeof(wire) - offset;
    if (count > sizeof(status->config_chunk)) count = sizeof(status->config_chunk);
    memcpy(status->config_chunk, wire + offset, count);
    return 0;
  }
  if (command != BKCONTROL_CONFIG_BEGIN && command != BKCONTROL_CONFIG_APPLY) return -EINVAL;
  if (!g_agent_trigger.selection_known) return -EAGAIN;
  if (g_agent_trigger.uncertain) return -EINPROGRESS;
  if ((g_agent_trigger.recognizing && !bk7258_agent_trigger_armed()) ||
      g_agent_trigger.pending_record) return -EBUSY;
  if ((kind == BKCONTROL_CONFIG_WAKE_MODEL &&
      (size <= BKVOICE_WAKE_PACKAGE_HEADER || size > BKCONTROL_CONFIG_RECORD_MAX)) ||
      (kind == BKCONTROL_CONFIG_WAKE_RESTORE && size != 4)) return -EMSGSIZE;
  if (kind == BKCONTROL_CONFIG_WAKE_RESTORE && !g_agent_trigger.previous_size) return -ENOENT;
  if (command == BKCONTROL_CONFIG_BEGIN) return 0;
  if (!record) return -EINVAL;
  if (kind == BKCONTROL_CONFIG_WAKE_RESTORE && memcmp(record, "WKR1", 4)) return -EBADMSG;
  if (kind == BKCONTROL_CONFIG_WAKE_MODEL)
  {
    struct bkvoice_wake_package_s spec;
    int ret = bkvoice_wake_package_decode(record, size, &spec);
    if (ret) return ret;
  }
  g_agent_trigger.pending_record = malloc(size);
  if (!g_agent_trigger.pending_record) return -ENOMEM;
  memcpy(g_agent_trigger.pending_record, record, size);
  g_agent_trigger.pending_size = size;
  g_agent_trigger.pending_kind = kind;
  g_agent_trigger.error = 0;
  return 0;
}

/* Plays the local acknowledgement PCM on the first wake only; it follows the
 * Agent's drain and release contract and starts no ASR turn.
 */
static int trigger_reply(void)
{
  int fd = open(CONFIG_MEDIA_SERVER_CONFIG_PATH "/wake_reply.pcm", O_RDONLY);
  if (fd < 0) return -errno;
  audio_playback_t *player = audio_playback_open(NULL, 16000, 1, 16);
  int ret = player ? 0 : -(errno ? errno : EIO);
  uint8_t pcm[640];
  while (player && ret >= 0)
  {
    ssize_t size = read(fd, pcm, sizeof(pcm));
    if (size < 0 && errno == EINTR) continue;
    if (size < 0) { ret = -errno; break; }
    if (size == 0) { ret = audio_playback_drain(player, 2000); break; }
    if (size % 2) { ret = -EINVAL; break; }
    ret = audio_playback_write(player, pcm, size);
    if (ret >= 0 && ret != size) ret = -EIO;
  }
  close(fd);
  int closed = audio_playback_close(player);
  return closed < 0 ? closed : ret;
}

int bk7258_agent_trigger_process(void)
{
  if (!atomic_exchange(&g_agent_trigger.turn_pending, false)) return 0;
  int ret = trigger_pause();
  int callback_error = atomic_exchange(&g_agent_trigger.callback_error, 0);
  if (!ret && callback_error) ret = callback_error;
  if (!ret)
  {
    int reply = trigger_reply();
    syslog(reply ? LOG_WARNING : LOG_INFO, "BKVOICE wake reply result=%d\n", reply);
    /* A missing prompt or a failed playback does not cancel the interaction,
     * but the player must first be confirmed released.
     */
    ret = audio_playback_cleanup(100);
  }
  if (!ret) ret = voice_channel_start_auto();
  if (ret < 0)
  {
    syslog(LOG_WARNING, "BKVOICE official Trigger turn start failed=%d\n", ret);
    if (!callback_error) (void)bk7258_agent_trigger_rearm();
  }
  return ret;
}
